app/app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users`
---
  def authenticate
    render_url='new'
    @email=params[:user][:email]
    @password=params[:user][:password]
    @status='failed'
      User.all.each do | userInDB |