app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.is_banned = 0
    @user.country=params[:country]
    @user.state=params[:state]
    @user.city=params[:city]

    #User Save to Database
    if @user.save
---
INSERT INTO `users` (`username`, `email`, `password`, `first_name`, `last_name`, `address`, `is_admin`, `created_at`, `updated_at`) VALUES ('Update Username', 'adobes@asidbsi.com', 'edwinedwin', 'edwin', 'ero', 'Update Address', 0, '2016-06-18 05:37:09', '2016-06-18 05:37:09')