app/app/views/dashboards/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
---
        </div>
        <% current_user=User.find(session[:user_id]) %>